---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorDomain(System.Int32)
source: html/f02ed712-2e58-d96b-b807-02e0e3940087.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorDomain Method

Gets the fabrication connector domain from its identifier.

## Syntax (C#)
```csharp
public ConnectorDomainType GetFabricationConnectorDomain(
	int fabricationConnectorId
)
```

## Parameters
- **fabricationConnectorId** (`System.Int32`) - The fabrication connector identifier.

## Returns
The fabrication connector's domain.